#include <iostream>

using namespace std;

int main()
{
	unsigned short x = 10;
	// 0000 0000 0000 1010
	cout << "Побітовий зсув числа 10: \n";
	// 0000 0000 0000 1010 >> 0000 0000 0000 0101 (5)
	cout << "Праворуч на 1 біт: " << (x >> 1) << '\n';
	// 0000 0000 0000 1010 << 0000 0000 0001 0100 (20)
	cout << "Ліворуч на 1 біт: " << (x << 1) << '\n';

	//HE

	cout << "Побітове заперечення (інверсія) числа 10: ";
	// 0000 0000 0000 1010 -> 1111 1111 1111 0101 (-11)
	cout << ~x << '\n';

	//АБО

	cout << "Побітове АБО (|) чисел 10 та 25: ";
	// 0000 0000 0000 1010 (10)
	// 0000 0000 0001 1001 (25)
	// 0000 0000 0001 1011 (27)
	cout << (x | y) << '\n';


}